/*=========================================================================*
 *	     					  		文件说明	                            *
 *	内核主函数,组织成可支持多平台的结构，主函数部分保证架构无关
 *=========================================================================*/
#include "type.h"
#include "const.h"
#include "string.h"
#include "proc.h"
#include "global.h"
#include "archproto.h"

/*======================================================================*
 *	     					   内核主函数体                               *
 *======================================================================*/
PUBLIC void kernel_main()
{
	disp_str("now in kmain.\n");

	irq_8259_unmask(0U);
}
